$(document).ready(function () {
    hopscotch.startTour({
        id: "dashboard-tour",
        steps: [
            {
                target: "menu-tour",
                title: "अन्य प्रणालीहरू प्रयोग गर्न यहाँ क्लिक गर्नुहोस्",
                content:
                "&#8594; नागरिक वडापत्र<br>" +
                "&#8594; दर्ता चलानी प्रणाली<br>"+
                "&#8594; सूची दर्ता प्रणाली<br>" +
                "&#8594; हेल्प डेस्क<br>"+
                "&#8594; ई-गुनासो<br>"+
                "&#8594; ई-कार्यपालिका<br>" +
                "&#8594; घर नक्सा पास<br>"+
                "&#8594; व्यवसाय दर्ता<br>" +
                "&#8594; शिफारिस प्रणाली<br>"+
                "&#8594; कर्मचारी व्यवस्थापन<br>" +
                "&#8594; कार्य व्यवस्थापन<br>"+
                "&#8594; तालिम व्यवस्थापन<br>" +
                "&#8594; न्यायिक समिति<br>"+
                "&#8594; योजना व्यवस्थापन<br>" +
                "&#8594; अनुदान व्यवस्थापन<br>"+
                "&#8594; राजस्व<br>",
                placement: "right",
            },
            {
                target: "fiscalyear-tour",
                title: "यो चालु आर्थिक वर्ष हो",
                content:"सम्पूर्ण प्रणालीको डाटा यस आर्थिक वर्ष अनुसार सञ्चालन हुन्छ ।",
                placement: "left",
            },
            {
                target: "full-tour",
                title: "",
                content:"यो फुल-स्क्रीनको लागि हो ।",
                placement: "left",
            },
            {
                target: "noti-tour",
                title: "नोटिफिकेसन",
                content:"सबै कार्यहरू सूचित गर्छ ।",
                placement: "left",
            },
            {
                target: "profile-tour",
                title: "प्रयोगकर्ता प्रोफाइल",
                content: "&#8594; प्रयोगकर्ता प्रोफाइल हेर्न/सम्पादन गर्न<br>" +
                "&#8594; प्रणालीको गतिविधिहरू हेर्न<br>"+
                "&#8594; प्रणालीको सेटिङ परिर्वतन गर्न<br>"+
                "&#8594; वेबसाइटको सेटिङ परिर्वतन गर्न<br>"+
                "&#8594; प्रणालीबाट बाहिर निस्किन<br>",
                placement: "left",
            }

        ],
        showPrevButton: !0
    })
});
