$(document).ready(function () {
    hopscotch.startTour({
        id: "my-intro",
        steps: [
            {
                target: "logo-tour",
                title: "डिजिटल ई-पालिकाको लोगो",
                placement: "bottom",
                yOffset: 10,
                xOffset: -105,
                arrowOffset: "center"
            },
            {
                target: "system-intro",
                title: "प्रणालीको परिचय",
                content: "निन्जा इन्फोसिस् प्रा. ली. सूचना प्रविधि र यससंग सम्बन्धित वस्तु तथासेवाहरुको उत्पादन र प्रवद्र्धन गर्ने उद्देश्यले स्थापना कम्पनी हो। निन्जा इन्फोसिस् प्रा. ली. विशेषतः सूचना प्रविधिको प्रयोग मार्फत निजी, सरकारी तथा गैर सरकारीसंघ/संस्थाहरुको कार्य सम्पादनलाई सजिलो, प्रभावकारी र सुरक्षित राख्न सफ्टवेयरहरुको उत्पादन, प्रबद्र्धन र निर्माण गर्दै आएको एक प्रतिष्ठित कम्पनी हो। ग्रामिण तथा शहरी क्षेत्रमा स्थापना भएका निजी, सरकारी र गैर सरकारी सङ्घ/संस्थाहरुको समस्यारुलाई नजिकबाट अध्ययन, अनुसन्धान र सम्बन्धित समुहहरुसंग छलफल तथा अन्तक्र्रिया कार्यक्रम गरी समस्याको पहिचान गर्दछ। त्यस पश्चात कार्यालयको काम कार्बाहीलाई चुस्तदुरुस्त बहुउपयोगी, प्रयोगकर्ताका दृष्टिकोणबाट सजिलो तथा संस्थाका तथ्यांकहरुलाई सुरक्षित राख्न सक्ने सफ्टवयेर र सिस्टमको निर्माण गर्दछ। यस कम्पनीले विशेष गरी हालसम्म सबै प्रदेशमा आफ्नो सेवा विस्तार गरेको छ।",
                placement: "bottom",
                zindex: 9999
            },
            {
                target: "system-aim",
                title: "लक्ष्य",
                content: "आधुनिक सूचना प्रविधि र परिवेशलाई सुहाउँदो सिस्टम सफ्टवयेर निर्माण गरी सेवाग्राहीहरुलाई सरल, सुरक्षित, भरपर्दो आई. टी. सेवाहरु एवं परामर्शहरु उचित मुल्यमा वितरण गरी सन्तुष्टि दिनु नै हाम्रो मुख्य लक्ष्य हो।",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "why-we",
                title: "हामी किन",
                content: "हामी अहिले टेक्नोलोजीको युगमा बाँचिरहेका छौ। संसार गोजीमा हालेर हिड्ने समय एउटा मोबाइल फोन/कम्प्युटरले हामीलाई उपलब्ध गराएको छ। यसै कम्प्युटरमा एउटा सानो सफ्टवेयर समावेश गरेर हामी संसारका कुनै पनि क्षेत्रमा सारा सुचना र सेवाहरु एकै पटक बटन दबाएर वा स्किन स्वाप गरेर प्राप्त गर्न सक्छौ। हामी सफ्टवयेरको कुरा मात्र गर्दैनौ, हामी सफ्टवेयर तथा टेक्नोलोजीज् सँगै मानिसले प्राप्त गर्ने मानविय सोच र आधुनिकिकरणसँगै जीवनमा पार्न सक्ने सकारात्मक प्रभाव र सुविधाको कुरा गर्छौ। हामी विश्वास दिलाउन चाहन्छौ कि हामीले सफ्टवेयरको विकास, प्रवर्धन, व्यवस्थापन र नेतृत्वमा उत्कृष्ट विज्ञहरूको विज्ञतालाई प्रस्तुत गर्दै आएका छौ । हामीलाई उत्कृष्ट सेवा दिने लक्ष्यमा तपाईंको पनि साथ र सहयोग प्राप्त हुने कुरोले हामी एकदमे उत्साहित भएको कुरा हामी यहाँ व्यक्त गर्न चाहन्छौ।",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "our-system",
                title: "हामीसंग भएका प्रणालीहरु",
                content: "हामीले प्रदान गर्ने सब्बै प्रणालीहरुको छोटो परिचय।",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "citizen",
                title: "नागरिक वडापत्र",
                content:
                    "&#8594; कार्यालयले प्रदान गर्ने सपुर्ण सूचना समाचार हेर्न मिल्ने<br>" +
                    "&#8594; संदेशमुलक भिडियो, अडियो राख्न हेर्न मिल्ने<br>" +
                    "&#8594; पालिका बाट प्रदान हुने नयाँ सूचना राख्न मिल्ने<br>" +
                    "&#8594; हेल्प डेस्क सेवा समावेस गर्न मिल्ने<br>" +
                    "&#8594; कर्मचारी बिवरण/ प्रमुख व्यक्तिको बिवरण राख्न मिल्ने",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "darta",
                title: "दर्ता चलानी प्रणाली",
                content:
                    "&#8594; दर्ता रजिष्टर तथा चलानी रजिष्टर छुट्टाछुट्टै भएको <br>" +
                    "&#8594; प्राप्त चिठ्ठी पत्रलाई दर्ता तथा चलानी नम्बर संगै Upload गर्न सकिने <br>" +
                    "&#8594; आवश्यक परेको खण्डमा दर्ता नम्बर  SMS को माध्यमबाट प्राप्त गर्न सकिने <br>" +
                    "&#8594; Upload गरिएका अभिलेख आफुले चाहेको समयमा खोज्न/हेर्न वा डाउनलोड गर्न मिल्ने <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "listregistration",
                title: "सुची दर्ता प्रणाली",
                content:
                    "&#8594; दर्ता रजिष्टर तथा चलानी रजिष्टर छुट्टाछुट्टै भएको <br>" +
                    "&#8594; प्राप्त चिठ्ठी पत्रलाई दर्ता तथा चलानी नम्बर संगै Upload गर्न सकिने <br>" +
                    "&#8594; आवश्यक परेको खण्डमा दर्ता नम्बर  SMS को माध्यमबाट प्राप्त गर्न सकिने <br>" +
                    "&#8594; Upload गरिएका अभिलेख आफुले चाहेको समयमा खोज्न/हेर्न वा डाउनलोड गर्न मिल्ने <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "helpdesk",
                title: "हेल्प डेस्क",
                content:
                    "&#8594; डिजिटल सेवा प्रवाह गर्न मिल्ने  <br>" +
                    "&#8594; शाखा अनुसार टोकन जेनेरेटर हुने  <br>" +
                    "&#8594; कुन शाखाबाट कुन सेवा प्रवाह हुन्छ सम्पूर्ण जानकारी लिन सकिने  <br>" +
                    "&#8594; सेवा दिने व्यक्तिको बिवरण समाबेस भएको  <br>" +
                    "&#8594; सेवा लिन आवश्यक कागजातहरुको बिवरण समाबेस भएको   <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "grievancehandling",
                title: "ई-गुनासो",
                content:
                    "&#8594; Mobile App तथा Website मार्फत कुनै पनि नागरिकले सम्बन्धित पालिकामा गुनासो दर्ता गर्न सक्नेछन् ।<br>" +
                    "&#8594; नगर/गाउँपालिकाले प्राप्त गुनासोका आधारमा आवश्यक काम कारवाही अगाडी बढाउन सकिने छ ।<br>" +
                    "&#8594; मासिक तथा वार्षिक रुपले गुनासोहरुको अवस्थाबारे विवरण देखाउनेछ ।<br>" +
                    "&#8594; सेवाग्राहीले आफुले गरेको गुनासोको अवस्थिति सजिलै थाहा पाउन सक्नेछन् । <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "executivemeeting",
                title: "ई-कार्यपालिका",
                content:
                    "&#8594; कार्यपालिकाको बैठक सेडुल गर्न मिल्ने<br>" +
                    "&#8594; बिदाको दिनमा सिस्टमले आफै कम गने <br>" +
                    "&#8594; अत्यावश्यक बैठक सेडुल गर्न मिल्ने <br>" +
                    "&#8594; कार्यपालिकाको बैठकको पुर्व जानकारी (Reminder) गर्ने  <br>" +
                    "&#8594; बैठकले पारित गरेका निर्णय राख्न वा प्रकाशन गर्न मिल्ने वा सूचना प्रवाह गर्न मिल्ने<br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "businessregistration",
                title: "व्यवसाय दर्ता",
                content:
                    "&#8594; व्यवसाय दर्ता गर्न मिल्ने <br>" +
                    "&#8594; नबिकरण गर्न मिल्ने <br>" +
                    "&#8594; दर्ता नबिकरण प्रमाण पत्र प्रिन्ट गर्न मिल्ने<br>" +
                    "&#8594; म्याद नाघेका फर्महरुको बिवरण हेर्न मिल्ने<br>" +
                    "&#8594; जरिवाना छुट वा सहजीकरण हुने<br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "emap",
                title: "घर नक्सा पास",
                content:
                    "&#8594; एकल पोर्टलमा अनलाइन नक्सा-पास।<br>" +
                    "&#8594; Building and floor details <br>" +
                    "&#8594; Technical, Sub-technical, registration<br>" +
                    "&#8594; प्रशासक डेस्क।<br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "recommendation",
                title: "शिफारिस प्रणाली",
                content:
                    "&#8594; शिफारिस प्रणाली<br>" +
                    "&#8594; शिफारिस प्रणाली <br>" +
                    "&#8594; शिफारिस प्रणाली<br>" +
                    "&#8594; शिफारिस प्रणाली<br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "yojana",
                title: "योजना व्यवस्थापन",
                content:
                    "&#8594; सम्पुर्ण योजना फारामहरु तथा अनुसूचीहरु (म ले प द्वारा परिमार्जित नयाँ फाराम सहित ) एउटै प्लेटफर्ममा उपलब्ध भएको । <br>" +
                    "&#8594; आवश्यक निकायहरुमा योजना तथा कार्यक्रम सम्बन्धि रिपोर्टहरु, सहने प्रस्तुत गर्न सकिने ।  <br>" +
                    "&#8594; योजना शाखाबाट सम्बन्धित निकायहरुलाई पठाउनु पर्ने योजनाहरुको प्रतिवेदन सहजै निकाल्न सकिने ।<br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "talim",
                title: "तालिम व्यवस्थापन",
                content:
                    "&#8594; पालिकाले प्रदान गर्ने सम्पूर्ण अनुदान बिवरण राख्न मिल्ने <br>" +
                    "&#8594; अनुदान को प्रकार बनाउन मिल्ने <br>" +
                    "&#8594; शाखा अनुसार छुट्टाछुट्टै User Role भएको <br>" +
                    "&#8594; सेवाग्राहीले अनुदान आवेदन फर्म भर्न मिल्ने <br>" +
                    "&#8594; आवश्यकता अनुसार रिपोर्ट निर्माण गर्न मिल्ने  <br>" +
                    "&#8594; पालिकाले मनिटरिङ गर्ने मिल्ने  <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "anudan",
                title: "अनुदान व्यवस्थापन",
                content:
                    "&#8594; पालिकाबाट प्रदान गरिएका तालिमको बिवरण राख्न मिल्ने <br>" +
                    "&#8594; प्रशिक्षकको प्रोफाइल राख्न हेर्न मिल्ने <br>" +
                    "&#8594; तालिम पछी प्रदान गर्ने प्रमाण पत्र अटोजेनेरेट हुने <br>" +
                    "&#8594; विभिन्न शीर्षक अनुसार तालिममा सहभागीहरुको बिवरण हेर्न मिल्ने <br>" +
                    "&#8594; आर्थिक वर्ष अनुसार व्यवस्थित डाटा राख्न मिल्ने  <br>" +
                    "&#8594; आवश्यकता अनुसार परिमार्जित गर्न मिल्ने <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "nyayik",
                title: "न्यायिक समिति",
                content:
                    "&#8594; न्यायिक समिति <br>" +
                    "&#8594; न्यायिक समिति <br>" +
                    "&#8594; न्यायिक समिति <br>" +
                    "&#8594; न्यायिक समिति <br>" +
                    "&#8594; न्यायिक समिति  <br>" +
                    "&#8594; न्यायिक समिति <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "kramachari",
                title: "कर्मचारी व्यवस्थापन",
                content:
                    "&#8594; सम्पुर्ण कर्मचारीको व्यक्तिगत विवरण यसै सफ्टवेयरबाट प्राप्त गर्न सकिनेछ ।  <br>" +
                    "&#8594; स्थायी तथा करार सेवाका कर्मचारीको सेवा अवधि (Notification) देखाउने छ ।  <br>" +
                    "&#8594; विदा विवरण अभिलेख गर्न सकिने छ । बदुवा तथा स्तरवृद्धि हुने सम्भाव्य मितीको (Notification) देखाउने छ ।  <br>",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "cautions",
                title: "प्रणाली सञ्चालन गर्नु अघि विचार गर्नुपर्ने कुराहरू",
                content: "",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "step-1",
                title: "प्रणाली सञ्चालन गर्नु अघि विचार गर्नुपर्ने कुराहरू",
                content: "",
                placement: "bottom",
                zindex: 999
            }
        ],
        showPrevButton: !0
    },
    {
        id: "dashboard-tour",
        steps: [
            {
                target: "menu-tour",
                title: "डिजिटल ई-पालिकाको लोगो",
                placement: "bottom",
                yOffset: 10,
                xOffset: -105,
                arrowOffset: "center"
            }

        ],
        showPrevButton: !0
    })
});
