$(document).ready(function () {
    hopscotch.startTour({
        id: "my-intro",
        steps: [
            {
                target: "logo-tour",
                title: "डिजिटल ई-पालिकाको लोगो",
                placement: "bottom",
                yOffset: 10,
                xOffset: -105,
                arrowOffset: "center"
            },
            {
                target: "system-intro",
                title: "प्रणालीको परिचय",
                content: "निन्जा इन्फोसिस् प्रा. ली. सूचना प्रविधि र यससंग सम्बन्धित वस्तु तथासेवाहरुको उत्पादन र प्रवद्र्धन गर्ने उद्देश्यले स्थापना कम्पनी हो। निन्जा इन्फोसिस् प्रा. ली. विशेषतः सूचना प्रविधिको प्रयोग मार्फत निजी, सरकारी तथा गैर सरकारीसंघ/संस्थाहरुको कार्य सम्पादनलाई सजिलो, प्रभावकारी र सुरक्षित राख्न सफ्टवेयरहरुको उत्पादन, प्रबद्र्धन र निर्माण गर्दै आएको एक प्रतिष्ठित कम्पनी हो। ग्रामिण तथा शहरी क्षेत्रमा स्थापना भएका निजी, सरकारी र गैर सरकारी सङ्घ/संस्थाहरुको समस्यारुलाई नजिकबाट अध्ययन, अनुसन्धान र सम्बन्धित समुहहरुसंग छलफल तथा अन्तक्र्रिया कार्यक्रम गरी समस्याको पहिचान गर्दछ। त्यस पश्चात कार्यालयको काम कार्बाहीलाई चुस्तदुरुस्त बहुउपयोगी, प्रयोगकर्ताका दृष्टिकोणबाट सजिलो तथा संस्थाका तथ्यांकहरुलाई सुरक्षित राख्न सक्ने सफ्टवयेर र सिस्टमको निर्माण गर्दछ। यस कम्पनीले विशेष गरी हालसम्म सबै प्रदेशमा आफ्नो सेवा विस्तार गरेको छ।",
                placement: "bottom",
                zindex: 9999
            },
            {
                target: "system-aim",
                title: "लक्ष्य",
                content: "आधुनिक सूचना प्रविधि र परिवेशलाई सुहाउँदो सिस्टम सफ्टवयेर निर्माण गरी सेवाग्राहीहरुलाई सरल, सुरक्षित, भरपर्दो आई. टी. सेवाहरु एवं परामर्शहरु उचित मुल्यमा वितरण गरी सन्तुष्टि दिनु नै हाम्रो मुख्य लक्ष्य हो।",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "why-we",
                title: "हामी किन",
                content: "हामी अहिले टेक्नोलोजीको युगमा बाँचिरहेका छौ। संसार गोजीमा हालेर हिड्ने समय एउटा मोबाइल फोन/कम्प्युटरले हामीलाई उपलब्ध गराएको छ। यसै कम्प्युटरमा एउटा सानो सफ्टवेयर समावेश गरेर हामी संसारका कुनै पनि क्षेत्रमा सारा सुचना र सेवाहरु एकै पटक बटन दबाएर वा स्किन स्वाप गरेर प्राप्त गर्न सक्छौ। हामी सफ्टवयेरको कुरा मात्र गर्दैनौ, हामी सफ्टवेयर तथा टेक्नोलोजीज् सँगै मानिसले प्राप्त गर्ने मानविय सोच र आधुनिकिकरणसँगै जीवनमा पार्न सक्ने सकारात्मक प्रभाव र सुविधाको कुरा गर्छौ। हामी विश्वास दिलाउन चाहन्छौ कि हामीले सफ्टवेयरको विकास, प्रवर्धन, व्यवस्थापन र नेतृत्वमा उत्कृष्ट विज्ञहरूको विज्ञतालाई प्रस्तुत गर्दै आएका छौ । हामीलाई उत्कृष्ट सेवा दिने लक्ष्यमा तपाईंको पनि साथ र सहयोग प्राप्त हुने कुरोले हामी एकदमे उत्साहित भएको कुरा हामी यहाँ व्यक्त गर्न चाहन्छौ।",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "our-system",
                title: "हामीसंग भएका प्रणालीहरु",
                content: "हामीले प्रदान गर्ने सब्बै प्रणालीहरुको छोटो परिचय।",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "citizen",
                title: "नागरिक वडापत्र",
                content:
                    "&#8594; कार्यालयले प्रदान गर्ने सपुर्ण सूचना समाचार हेर्न मिल्ने<br>" +
                    "&#8594; संदेशमुलक भिडियो, अडियो राख्न हेर्न मिल्ने<br>" +
                    "&#8594; पालिका बाट प्रदान हुने नयाँ सूचना राख्न मिल्ने<br>" +
                    "&#8594; हेल्प डेस्क सेवा समावेस गर्न मिल्ने<br>" +
                    "&#8594; कर्मचारी बिवरण/ प्रमुख व्यक्तिको बिवरण राख्न मिल्ने",
                placement: "bottom",
                zindex: 999
            },
            {
                target: "darta",
                title: "दर्ता चलानी प्रणाली",
                content:
                    "&#8594; दर्ता रजिष्टर तथा चलानी रजिष्टर छुट्टाछुट्टै भएको <br>" +
                    "&#8594; प्राप्त चिठ्ठी पत्रलाई दर्ता तथा चलानी नम्बर संगै Upload गर्न सकिने <br>" +
                    "&#8594; आवश्यक परेको खण्डमा दर्ता नम्बर  SMS को माध्यमबाट प्राप्त गर्न सकिने <br>" +
                    "&#8594; Upload गरिएका अभिलेख आफुले चाहेको समयमा खोज्न/हेर्न वा डाउनलोड गर्न मिल्ने <br>",
                placement: "bottom",
                zindex: 999
            }
        ],
        showPrevButton: !0
    })
});
