@extends('admin.layouts.master')

@section('content')
    <div class="row m-3">
        <div class="col-12">
            <div class="page-title-box">
                <div class="page-title-right">
                    <ol class="breadcrumb m-0">
                        <li class="breadcrumb-item">
                            <a href="{{ route('admin.dashboard') }}">
                                <img class="icon me-1" src="{{ asset('assets/backend/images/home.svg') }}"
                                     alt="document-icon">
                                गृहपृष्ठ
                            </a>
                        </li>

                        <li class="breadcrumb-item active">अभिलेखीकरण</li>
                    </ol>
                </div>
                <h4 class="page-title">मन्जुरी नामा</h4>
            </div>
        </div>
    </div>

    <div class="row">
        <div class="col-md-12">
            <div class="card p-0">
                <div class="card-header">
                    <div class="d-flex justify-content-between align-items-center">
                        <h4 class="header-title">मन्जुरी नामा </h4>
                        <div class="d-flex justify-content-between">
                            <x-print-button title="मन्जुरी नामा" target-element="printData"/>

                            <a href="{{ route('emap.admin.buildingDocumentation.index') }}"
                               class="btn btn-sm btn-outline-primary">
                                <i class="fa fa-list"> दर्ता भएका अभिलेखीकरण</i>
                            </a>
                        </div>
                    </div>
                </div>
                <div class="card-body px-0">
                    <div id="printData">

                                        <div class="text-center font-weight-bold">
                                            <h3><strong>मन्जुरी नामा :</strong></h3>
                                        </div>
                                        <div class="subject text-justify-center lh-lg px-5">
                                            <ol>
                                                <li>
                                                    राप्ती राजमार्गको केशमा सेन्टर लाईन देखी २५ मिटर र ३ मिटर सेट ब्याक गरि २८ मिटर दाँया
                                                    बाँया छोडेर भवन निर्माण गरेका छौ।
                                                </li>
                                                <li>
                                                    प्रदेश स्तरिय सडकको केशमा १२ मिटर (६ मिटर सेन्टर लाईन देखि र १.५ मिटर सेट ब्याक) दाँया
                                                    बाँया छोडेर भवन निर्माण गरेका छौ।
                                                </li>


                                                <li> नगरपालिकाको स्थानीय सडकको केशमा ६ मिटर (३ मिटर सेन्टर लाईन र १ मिटर सेट व्याक) दाँया
                                                    बाँया
                                                    छोडेर भवन निर्माण गरेका छौ।</li>

                                                <li> र्वजनिक जग्गा बाटो मिचिएको छैन / छैनौ। मिचिएको देखिएमा जुनसुकै बेला पनि निर्माण भएको घर
                                                    टहरा, पर्खाल हटाउँन तयार हुनेछु/हुनेछौ।</li>
                                                <li> साविकदेखि चलिआएको पानीको निकास बन्द गर्ने छैन/छैनौ। ढल निकासका लागि आवश्यक भएमा आफ्नो
                                                    जग्गाको कुनै छेउबाट ढलको पाईप दिनेछु/दिनेछौ।</li>

                                                <li> नगरपालिकाले अपनाएको फोहोरमैला व्यवस्थापन पतिमा कुनै बाधा बिरोध तथा झमेला गर्ने छैन/छैनौ
                                                    साथै नगरापालिकाले तोकेको शुल्क समेत तिर्न बुझाउन तयार हुनेछु/हुनेछौ ।</li>
                                                <li>पलास्टिक जन्य फोहोर जलाउने र वातावरण प्रदुषण गर्ने छैन/ छैनौ।</li>
                                                <li> घरभाडा लगाउँदा घरभाडा लागेको विवरण नगरपालिका पेश गर्नेछौ। नगरपालिकाले तोकेको
                                                    दर अनुसार घरभाडा कर तिर्न बुझाउन तयार हुनेछ/हुनेछौ ।</li>
                                            </ol>
                                            <p>
                                                माथि उल्लेखित भएका बुदाहरूको नि-शर्त रुपमा पालना गर्नेछु/ गर्नेछौ। कुनैपनि बुदाहरूको उल्लंघन
                                                गरेको ठहर भएमा नगरपालिकाबाट प्रदान गरिने भौतिक तथा अन्य सुविधाबाट समेत बञ्चित गरेमा
                                                मेरो/हाम्रो मन्जुरी छ।
                                            </p>
                                            <p>निवेदक वा निवेदक अनुपस्थित् भएमा मन्जुरीनामा प्राप्त व्यक्तिको :</p>
                                            <p>निवेदक :</p>
                                            <p> मन्जुरीनामा प्राप्त व्यक्ति :</p>
                                            <p>सहि :................................      सहि :...............................</p>
                                            <p>नाम :.................................     नाम :.................................</p>
                                            <p>ठेगाना :................................    ठेगाना :..................................</p>
                                            <p>मिति :.................................    मिति :.................................</p>
                                            <p>फोन नं. :..............................     फोन नं. :...............................</p>


                                        </div>
                                    </div>
                                </div>
                            </div>
                        </section>
                         </div>
                </div>
            </div>
        </div>
    </div>
@endsection
